# GetRenderingQualitySettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingSettings..::..GetRenderingQualitySettings Method
RenderingSettings Class See Also
---
Returns an object that represents the rendering quality settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RenderingQualitySettings GetRenderingQualitySettings()
```

Visual Basic
---
```text
Public Function GetRenderingQualitySettings As RenderingQualitySettings
```

Visual C++
---
```text
public:
RenderingQualitySettings^ GetRenderingQualitySettings()
```

# ### Return Value
The rendering quality settings.
# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace